class Menu
{
public:
    void PrintMainMenu() {
        std::cout << "----------------------Менеджер паролей---------------------" << std::endl;
        std::cout << "1. Добавить пароль                                         " << std::endl;
        std::cout << "2. Удалить пароль                                          " << std::endl;
        std::cout << "3. Зашифровать                                             " << std::endl;
        std::cout << "4. Дешифровать                                             " << std::endl;
        std::cout << "5. Настройки                                               " << std::endl;
        std::cout << "6. Помощь                                                  " << std::endl;
        std::cout << "7. Список паролей                                          " << std::endl;
        std::cout << "8. Выход                                                   " << std::endl;
        std::cout << "-----------------------------------------------------------" << std::endl;
        std::cout << "Ввод: ";
    }

    //Параметры функции: ( (булевая переменная, если верно и не верно, если не пароль) )
    void PrintAddPassword(bool Password) {
        if (!Password) {
            std::cout << "----------------------Добавить пароль----------------------" << std::endl;
            std::cout << "Введите к чему привязан пароль (почта, логин, и тд)        " << std::endl;
            std::cout << "-----------------------------------------------------------" << std::endl;
            std::cout << "Ввод: ";
        }
        else {
            std::cout << "----------------------Добавить пароль----------------------" << std::endl;
            std::cout << "Введите пароль                                             " << std::endl;
            std::cout << "-----------------------------------------------------------" << std::endl;
            std::cout << "Ввод: ";
        }
    }

    void PrintDelPassword() {
        std::cout << "----------------------Удалить пароль-----------------------" << std::endl;
        std::cout << "Введите ид пароля, который надо удалить, -1 - все          " << std::endl;
        std::cout << "-----------------------------------------------------------" << std::endl;
        std::cout << "Ввод: ";
    }

    void PrintEncrypt() {
        std::cout << "-------------------------Шифровка--------------------------" << std::endl;
        std::cout << "Введите ид пароля, который надо зашифровать, -1 - все      " << std::endl;
        std::cout << "-----------------------------------------------------------" << std::endl;
        std::cout << "Ввод: ";
    }

    void PrintDecrypt() {
        std::cout << "------------------------Дешифровка-------------------------" << std::endl;
        std::cout << "Введите ид пароля, который надо дешифровать, -1 - все      " << std::endl;
        std::cout << "-----------------------------------------------------------" << std::endl;
        std::cout << "Ввод: ";
    }
    void PrintSettings() {
        std::cout << "------------------------Настройка--------------------------" << std::endl;
        std::cout << "1. В разработке                                            " << std::endl;
        std::cout << "2. Выход                                                   " << std::endl;
        std::cout << "-----------------------------------------------------------" << std::endl;
        std::cout << "Ввод: ";
    }

    //Параметры функции : ((булевая переменная, успех - 1, не успех - 0), (код ошибки, стандартное значение - 0))
    void PrintSuccessFiled(bool Success, int errorid = 0) {
        if (Success) {
            std::cout << "Операция прошла успешно" << std::endl;
        }
        else {
            std::cout << "Операция не прошла успешно. Код ошибки: " << errorid << std::endl;
        }
    }

    void PrintHelp() {
        std::cout << "-------------------------Помощь----------------------------" << std::endl;
        std::cout << "1. Отобразить коды ошибок                                  " << std::endl;
        std::cout << "2. Отобразить FAQ                                          " << std::endl;
        std::cout << "-----------------------------------------------------------" << std::endl;
        std::cout << "Ввод: ";
    }

    void Pause() {
        std::system("pause");
    }

    void ClearMenu() {
        std::system("cls");
    }
};
